In [27]:
import pandas as pd
import numpy as np
import pandas

In [29]:
dataset = pd.read_csv("./data/train.csv")
predict = pd.read_csv('./data/test.csv')

In [33]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [34]:
cabin = []
for z in dataset['Cabin']:
    cabin.append([x for x in str(z)][0])
a = list(set(cabin))

In [35]:
diction = {}
for index,v in enumerate(a):
    diction[v] = index

In [36]:
diction

{'E': 0, 'B': 1, 'T': 2, 'G': 3, 'D': 4, 'F': 5, 'A': 6, 'n': 7, 'C': 8}

In [37]:
cb_encode=[]
for z in cabin:
    cb_encode.append(diction[z])

In [38]:
fare = []
for i in dataset['Fare']:
    if(i < 200):
        fare.append(1)
    else:
        fare.append(0)

In [39]:
age = []
for i in dataset['Age']:
    if(i < 16):
        age.append(1)
    else:
        age.append(0)

In [52]:
name = []

In [53]:
for i in dataset['Name']:
    if(i == 'Miss.'):
        name.append(0)
    if(i == 'Mrs.'):
        name.append(1)
    if(i == 'Mr.'):
        name.append(2)
    else:
        name.append(3)

In [207]:
# dataset = dataset.drop(['PassengerId', 'Cabin', 'Name', 'SibSp', 'Parch', 'Ticket'], axis=1)
# X_test_passengers = predict['PassengerId']
# X_test = predict.drop(['PassengerId', 'Cabin', 'Name', 'SibSp', 'Parch', 'Ticket'], axis=1)

In [40]:
dataset['Age_encode'] = age
dataset['cb_encode'] = cb_encode
dataset['fare_encode'] = fare

In [54]:
dataset['Name_en'] = name

In [56]:
s= []
for z in dataset['Sex']:
    if(z == 'male'):
        s.append(1)
    else:
        s.append(0)

In [66]:
ls = list(set(dataset['Embarked'].values))
dic = {}
for i,z in enumerate(ls):
    dic[z] = i

In [70]:
dic['S']

1

In [72]:
em_code = []
for x in dataset['Embarked']:
    em_code.append(dic[x])

In [74]:
dataset['Sex_encode'] = s
dataset['em_code'] = em_code

In [75]:
dataset.head()

,PassengerId,Survived,Pclass,SibSp,Parch,Fare,Embarked,Age_encode,cb_encode,fare_encode,Name_en,Sex_encode,em_code
0,1,0,3,1,0,7.2500,S,0,7,1,3,1,1
1,2,1,1,1,0,71.2833,C,0,8,1,3,0,3
2,3,1,3,0,0,7.9250,S,0,7,1,3,0,1
3,4,1,1,1,0,53.1000,S,0,8,1,3,0,1
4,5,0,3,0,0,8.0500,S,0,7,1,3,1,1

In [59]:
category = ['Name','Sex','Age','Ticket','Cabin']

In [61]:
for z in category:
    del dataset[z]

In [77]:
dataset.head()

,PassengerId,Survived,Pclass,SibSp,Parch,Fare,Age_encode,cb_encode,fare_encode,Name_en,Sex_encode,em_code
0,1,0,3,1,0,7.2500,0,7,1,3,1,1
1,2,1,1,1,0,71.2833,0,8,1,3,0,3
2,3,1,3,0,0,7.9250,0,7,1,3,0,1
3,4,1,1,1,0,53.1000,0,8,1,3,0,1
4,5,0,3,0,0,8.0500,0,7,1,3,1,1

In [88]:
from sklearn.feature_selection import SelectKBest
from sklearn.feature_selection import chi2

array = dataset.values

#Split the data into input and target

X = array[:,2:]

Y = array[:,1]

#We will select the features using chi square

test = SelectKBest(score_func=chi2, k=4)

#Fit the function for ranking the features by score

fit = test.fit(X, Y)

#Summarize scores numpy.set_printoptions(precision=3) print(fit.scores_)

#Apply the transformation on to dataset

features = fit.transform(X)

In [90]:
print(fit.scores_)

[3.08736994e+01 2.58186538e+00 1.00974991e+01 4.51831909e+03
 1.49682890e+01 3.49244053e+01 1.94096221e-01 0.00000000e+00
 9.27024470e+01 1.02724500e+01]

In [91]:
features

array([[ 3.    ,  7.25  ,  7.    ,  1.    ],
       [ 1.    , 71.2833,  8.    ,  0.    ],
       [ 3.    ,  7.925 ,  7.    ,  0.    ],
       ...,
       [ 3.    , 23.45  ,  7.    ,  0.    ],
       [ 1.    , 30.    ,  8.    ,  1.    ],
       [ 3.    ,  7.75  ,  7.    ,  1.    ]])

In [105]:
data = pd.DataFrame(features, columns = ['Pclass', 'Fare','cb_encode','Sex_encode'])

In [107]:
Y = pd.DataFrame(Y, columns = ['Survived'])

In [109]:
Y.head()

   Survived
0       0.0
1       1.0
2       1.0
3       1.0
4       0.0

In [283]:
X_train = dataset.iloc[:, 1:17]
Y_train = dataset.iloc[:, 0]
X_test = X_test

In [285]:
Y_train.head()

0    1
1    2
2    3
3    4
4    5
Name: PassengerId, dtype: int64

In [284]:
X_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilyS,Age_encode,cb_encode,fare_encode
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,Couple,0,4,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,Couple,0,2,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,Single,0,4,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,Couple,0,2,1
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,Single,0,4,1

In [212]:
categories = ['Sex','Embarked','Title','FamilyS','Age','Fare']

In [213]:
for i in categories:
    dfDummies = pd.get_dummies(X_train[i], prefix = 'ctg')
    X_train = pd.concat([X_train, dfDummies], axis=1, sort=False)

In [214]:
X_train.shape

(891, 360)

In [215]:
for i in categories:
    del X_train[i]

In [258]:
X_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN

In [110]:
from sklearn.model_selection import train_test_split

x_train, x_val, y_train, y_val = train_test_split(data, Y, test_size = 0.3)

In [111]:
import pandas as pd
from xgboost import XGBClassifier
from sklearn.metrics import accuracy_score

In [112]:
model = XGBClassifier()

# fit the model with the training data

In [113]:
model.fit(x_train,y_train)

/usr/local/lib/python3.7/site-packages/sklearn/preprocessing/label.py:219: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/site-packages/sklearn/preprocessing/label.py:252: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0,
              learning_rate=0.1, max_delta_step=0, max_depth=3,
              min_child_weight=1, missing=None, n_estimators=100, n_jobs=1,
              nthread=None, objective='binary:logistic', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
              silent=None, subsample=1, verbosity=1)

In [114]:
# predict the target on the train dataset
predict_train = model.predict(x_val)

# Accuray Score on train dataset
accuracy_train = accuracy_score(y_val,predict_train)
accuracy_train

0.7350746268656716